# Pair Programming EDA I

Objetivos
Los objetivos de hoy son:
1. Haced una exploración inicial del dataframe:
- ¿Cuál es el número de filas y columnas?
- ¿Cuál es el porcentaje de valores nulos en cada columna? Presenta los resultados en un dataframe, donde las columnas sean el nombre de las variables y el porcentaje de nulos.
- ¿Qué tipos de datos hay en cada columna?
- Extraed la información general del dataframe.

In [32]:
import pandas as pd

In [33]:
pd.options.display.max_columns=None

In [34]:
df = pd.read_csv('../datos/datos_ataques.csv', index_col= 0)

In [35]:
df.head(2)

,case_number,year,type,country,area,location,activity,name,age,time,species_,href,injury,date,mes,fatal,sexo
0,2018.06.25,2018.0,Boating,USA,California,"Oceanside, San Diego County",Paddling,Julie Wolfe,57,18h00,White shark,http://sharkattackfile.net/spreadsheets/pdf_di...,"No injury to occupant, outrigger canoe and pad...",25-Jun-2018,Jun,n,F
1,2018.06.03.a,2018.0,Unprovoked,BRAZIL,Pernambuco,"Piedade Beach, Recife",Swimming,Jose Ernesto da Silva,18,Late afternoon,Tiger shark,http://sharkattackfile.net/spreadsheets/pdf_di...,FATAL,03-Jun-2018,Jun,y,M

1.1. Número filas y columnas

In [36]:
print(f'El DataFrame tiene en total {df.shape[0]} filas y {df.shape[1]} columnas')

El DataFrame tiene en total 1672 filas y 17 columnas

1.2. ¿Cuál es el porcentaje de valores nulos en cada columna? Presenta los resultados en un dataframe, donde las columnas sean el nombre de las variables y el porcentaje de nulos.

In [37]:
porcentaje_null = (pd.DataFrame(round((df.isnull().sum()*100/df.shape[0]), 2))).T

In [38]:
porcentaje_null

,case_number,year,type,country,area,location,activity,name,age,time,species_,href,injury,date,mes,fatal,sexo
0,0.0,0.0,0.0,0.6,2.75,3.05,1.85,0.54,9.21,9.57,7.54,0.0,0.48,0.0,2.99,5.8,0.84

1.3. ¿Qué tipos de datos hay en cada columna?

In [39]:
df.dtypes

case_number     object
year           float64
type            object
country         object
area            object
location        object
activity        object
name            object
age             object
time            object
species_        object
href            object
injury          object
date            object
mes             object
fatal           object
sexo            object
dtype: object

1.4. Extraed la información general del dataframe.

In [40]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 1672 entries, 0 to 1671
Data columns (total 17 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   case_number  1672 non-null   object
 1   year         1672 non-null   float64
 2   type         1672 non-null   object
 3   country      1662 non-null   object
 4   area         1626 non-null   object
 5   location     1621 non-null   object
 6   activity     1641 non-null   object
 7   name         1663 non-null   object
 8   age          1518 non-null   object
 9   time         1512 non-null   object
 10  species_     1546 non-null   object
 11  href         1672 non-null   object
 12  injury       1664 non-null   object
 13  date         1672 non-null   object
 14  mes          1622 non-null   object
 15  fatal        1575 non-null   object
 16  sexo         1658 non-null   object
dtypes: float64(1), object(16)
memory usage: 235.1+ KB

2. Cread dos dataframes nuevos, uno que incluya solo las variables categóricas y otro que incluya solo las variables numéricas.
- ¿Cuáles son los principales estádisticos de los dataframes?
- Extraed los valores únicos su frecuencia. BONUS presenta los resultados en un dataframe.

2.1. ¿Cuáles son los principales estádisticos de los dataframes?

In [41]:
categorias = pd.DataFrame(df.select_dtypes(include = 'object'))
categorias.describe()

,case_number,type,country,area,location,activity,name,age,time,species_,href,injury,date,mes,fatal,sexo
count,1672,1672,1662,1626,1621,1641,1663,1518,1512,1546,1672,1664,1672,1622,1575,1658
unique,1672,6,95,236,1310,404,1536,94,248,856,1672,1173,1522,54,2,2
top,2018.06.25,Unprovoked,USA,Florida,"New Smyrna Beach, Volusia County",Surfing,male,19,11h00,White shark,http://sharkattackfile.net/spreadsheets/pdf_di...,FATAL,No date,Aug,n,M
freq,1,1432,741,346,73,426,97,70,74,76,1,154,6,158,1258,1435

In [42]:
categorias.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 1672 entries, 0 to 1671
Data columns (total 16 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   case_number  1672 non-null   object
 1   type         1672 non-null   object
 2   country      1662 non-null   object
 3   area         1626 non-null   object
 4   location     1621 non-null   object
 5   activity     1641 non-null   object
 6   name         1663 non-null   object
 7   age          1518 non-null   object
 8   time         1512 non-null   object
 9   species_     1546 non-null   object
 10  href         1672 non-null   object
 11  injury       1664 non-null   object
 12  date         1672 non-null   object
 13  mes          1622 non-null   object
 14  fatal        1575 non-null   object
 15  sexo         1658 non-null   object
dtypes: object(16)
memory usage: 222.1+ KB

In [43]:
numericas = pd.DataFrame(round(df.describe(),2))
numericas

          year
count  1672.00
mean   1832.69
std     528.97
min       0.00
25%    1964.00
50%    1997.00
75%    2008.00
max    2018.00

In [44]:
categorias.shape

(1672, 16)

In [45]:
categorias.columns

Index(['case_number', 'type', 'country', 'area', 'location', 'activity',
       'name', 'age', 'time', 'species_', 'href', 'injury', 'date', 'mes',
       'fatal', 'sexo'],
      dtype='object')

2.1 - Extraed los valores únicos su frecuencia. BONUS presenta los resultados en un dataframe.

In [46]:
for col in categorias.columns:
    
        print ("------------------------------------------------------------", "\n")
        print(f"En la columna {col} tenemos los siguientes valores unicos:")
        print(pd.DataFrame(df[col].value_counts()))
        print("\n", "------------------------------------------------------------", "\n")

------------------------------------------------------------

En la columna case_number tenemos los siguientes valores unicos:
              case_number
2018.06.25              1
1975.07.15              1
1979.11.27              1
1980.00.00.b            1
1980.01.10              1
...                   ...
2005.10.13              1
2005.10.19              1
2005.10.21              1
2005.10.22              1
ND.0001                 1

[1672 rows x 1 columns]

 ------------------------------------------------------------

------------------------------------------------------------

En la columna type tenemos los siguientes valores unicos:
              type
Unprovoked    1432
Provoked       115
Invalid         92
Boating         17
Sea Disaster    12
Boat             4

 ------------------------------------------------------------

------------------------------------------------------------

En la columna country tenemos los siguientes valores unicos:
                    country
USA                     741
AUSTRALIA               343
SOUTH AFRICA            234
BAHAMAS                  29
NEW ZEALAND              21
...                     ...
GREENLAND                 1
ST. MAARTIN               1
UNITED KINGDOM            1
SWEDEN                    1
CEYLON (SRI LANKA)        1

[95 rows x 1 columns]

 ------------------------------------------------------------

------------------------------------------------------------

En la columna area tenemos los siguientes valores unicos:
                                                    area
Florida                                              346
California                                           137
New South Wales                                      137
Hawaii                                               108
Western Cape Province                                 83
...                                                  ...
KwaZulu-Natal between Port Edward and Port St J...     1
Miyako Island                                          1
Saint-Pierre                                           1
Ralik Chain                                            1
North Carolina                                         1

[236 rows x 1 columns]

 ------------------------------------------------------------

------------------------------------------------------------

En la columna location tenemos los siguientes valores unicos:
                                     location
New Smyrna Beach, Volusia County           73
Myrtle Beach, Horry County                  7
Nahoon                                      7
Daytona Beach, Volusia County               7
Melbourne Beach, Brevard County             6
...                                       ...
Kangaroo Island                             1
Sunny Cove, Fish Hoek                       1
Jack McKenney's Canyon                      1
Honokowai, Maui                             1
Below the English fort, Trincomalee         1

[1310 rows x 1 columns]

 ------------------------------------------------------------

------------------------------------------------------------

En la columna activity tenemos los siguientes valores unicos:
                                      activity
Surfing                                    426
Swimming                                   240
Spearfishing                               105
Fishing                                     56
Wading                                      53
...                                        ...
Playing / standing                           1
Swimming with mask & snorkel                 1
Dived naked into the water on a bet          1
Swimming breast stoke                        1
Wreck of  large double sailing canoe         1

[404 rows x 1 columns]

 ------------------------------------------------------------

------------------------------------------------------------

En la columna name tenemos los siguientes valores unicos:
                   name
male                 97
female               16
males                 4
child                 3
Andre Hartman         3
...                 ...
Elizabeth Gardner     1
Clair Parrett         1
Brad Satchell         1
Josh Berris           1
Jules Patterson       1

[1536 rows x 1 columns]

 ------------------------------------------------------------

------------------------------------------------------------

En la columna age tenemos los siguientes valores unicos:
          age
19         70
18         60
20         58
15         57
17         57
...       ...
64          1
74          1
40s         1
60s         1
13 or 14    1

[94 rows x 1 columns]

 ------------------------------------------------------------

------------------------------------------------------------

En la columna time tenemos los siguientes valores unicos:
                     time
11h00                  74
Afternoon              69
16h00                  53
15h00                  51
Morning                50
...                   ...
23h00                   1
Just before sundown     1
"Evening"               1
12h39                   1
Before 10h30            1

[248 rows x 1 columns]

 ------------------------------------------------------------

------------------------------------------------------------

En la columna species_ tenemos los siguientes valores unicos:
                                                    species_
White shark                                               76
Tiger shark                                               37
4' shark                                                  34
Bull shark                                                32
Shark involvement not confirmed                           26
...                                                      ...
1.2 m [4'] blacktip or sandbar shark                       1
Bull shark, 1.8 m to 2.1 m [6' to 7']                      1
Mako shark, 400-lb                                         1
1.2 m to 1.5 m [4' to 5'] shark, possibly a bul...         1
Said to involve a grey nurse shark that leapt o...         1

[856 rows x 1 columns]

 ------------------------------------------------------------

------------------------------------------------------------

En la columna href tenemos los siguientes valores unicos:
                                                    href
http://sharkattackfile.net/spreadsheets/pdf_dir...     1
http://sharkattackfile.net/spreadsheets/pdf_dir...     1
http://sharkattackfile.net/spreadsheets/pdf_dir...     1
http://sharkattackfile.net/spreadsheets/pdf_dir...     1
http://sharkattackfile.net/spreadsheets/pdf_dir...     1
...                                                  ...
http://sharkattackfile.net/spreadsheets/pdf_dir...     1
http://sharkattackfile.net/spreadsheets/pdf_dir...     1
http://sharkattackfile.net/spreadsheets/pdf_dir...     1
http://sharkattackfile.net/spreadsheets/pdf_dir...     1
http://sharkattackfile.net/spreadsheets/pdf_dir...     1

[1672 rows x 1 columns]

 ------------------------------------------------------------

------------------------------------------------------------

En la columna injury tenemos los siguientes valores unicos:
                                                    injury
FATAL                                                  154
Foot bitten                                             28
Leg bitten                                              20
No injury, board bitten                                 17
Left foot bitten                                        17
...                                                    ...
Left knee & leg bitten                                   1
Calf bitten & both hands injured                         1
Back, buttocks, left hand & left side of face b...       1
Right forearm & wrist lacerated                          1
FATAL. "Shark bit him in half, carrying away th...       1

[1173 rows x 1 columns]

 ------------------------------------------------------------

------------------------------------------------------------

En la columna date tenemos los siguientes valores unicos:
                      date
No date                  6
No date, Before 1963     5
Before 1906              4
Before 1958              4
18-Aug-2001              3
...                    ...
18-Jun-2005              1
22-Jun-2005              1
25-Jun-2005              1
27-Jun-2005              1
1845-1853                1

[1522 rows x 1 columns]

 ------------------------------------------------------------

------------------------------------------------------------

En la columna mes tenemos los siguientes valores unicos:
               mes
Aug            158
Sep            153
Oct            146
Jul            143
Jun            134
Jan            126
Apr            124
May            105
Mar            104
Dec            103
Nov             99
Feb             95
Before          56
NoBefore        11
No               7
Ca               6
Reported         4
Summer           3
Circa            2
NoBeforeMay      2
NoBeforeAug      2
Between          2
BeforeJun        2
WorldWarII       2
ReportedMay      2
ReportedFeb      2
BeforeJul        2
NoAfterAugust    1
NoBeforeJan      1
BeforeApr        1
BeforeMar        1
NoBeforeMar      1
Said             1
BeforeFeb        1
Early            1
During           1
ReportedApr      1
Beforer          1
MarMar           1
May2015          1
ReportedJun      1
ReportedDec      1
ReportedJan      1
MidJulJul        1
MidAug           1
ReportedAug      1
BeforeOct        1
ReportedSep      1
ReportedJul      1
ReportedOct      1
June             1
LateReported     1
LetterJan        1
NoJul            1

 ------------------------------------------------------------

------------------------------------------------------------

En la columna fatal tenemos los siguientes valores unicos:
   fatal
n   1258
y    317

 ------------------------------------------------------------

------------------------------------------------------------

En la columna sexo tenemos los siguientes valores unicos:
   sexo
M  1435
F   223

 ------------------------------------------------------------

-----------------------------------------------------------------------------